Repository: payskyCompany/UPG-PayButton-SDK-ios
Catalog: PayButton/Strings/*.lproj/LocalizablePaySKy.strings
Languages: ar

# app_name_paysky
source: PayButton
ar: زر الدفع

# Merchant ID_paysky
source: Merchant ID
ar: رقم التاجر

# Terminal ID_paysky
source: Terminal ID
ar: نقطة البيع

source: Amount
ar: المبلغ

# Currency_paysky
source: Currency
ar: العملة

# change_lang
source: Change Language
ar: تغيير اللغة

source: Done
ar: تأكيد

# request_send_to_mobile
source: The payment has been requested
ar: تم ارسال الطلب بنجاح

# scanCard
source: Scan card data
ar: افحص بيانات الكارت

source: Pay Now
ar: ادفع الآن

# card_information_wrong
source: Invalid card information
ar: بيانات الكارت غير صحيحة

# quick_payment_from
source: Quick Payment form
ar: الدفع السريع

source: MERCHANT
ar: التاجر

source: AMOUNT
ar: المبلغ

# arabic
source: عربى
ar: English

# terms_conditions
source: Terms and conditions
ar: الشروط والاحكام

source: Card
ar: بطاقة

# wallet
source: Meeza Digital
ar: ميزة ديجيتال

# enter_card_data
source: Please enter card data
ar: تحقق من ادخال بيانات البطاقة

source: Card number
ar: رقم البطاقة

# name_on_card
source: Card holder name
ar: اسم صاحب البطاقة

# expire_date
source: Expiry date
ar: تاريخ الانتهاء

source: CVC
ar: رمز الحماية

source: Proceed
ar: تأكيد

source: Error
ar: خطأ

# check_internet_connection
source: Check internet connection and try again.
ar: تحقق من الاتصال بالانترنت,وحاول مرة أخرى

source: OK
ar: موافق

# invalid_card_number_length
source: Please re-enter 16 card number.
ar: تحقق من ادخال 16 رقم للبطاقة

# enter_valid_owner
source: Enter valid owner name.
ar: اسم صاحب البطاقة غير صحيح

# invalid_expire_date
source: Card expiry date should be 4 digits.
ar: تاريخ الانتهاء يجب الا يزيد عن اربع ارقام

# invalid_ccv
source: CCV should be 3 digits length.
ar: رمز الحماية يجب ان يكون 3 ارقام

source: Please wait…
ar: برجاء الانتظار…

# error_try_again
source: Error in connection, try again.
ar: خطأ فى الاتصال,حاول مرة أخرى

# auth_number
source: Auth code:
ar: رقم الموافقة

# trx_id
source: Transaction No:
ar: رقم المعاملة

source: Close
ar: اغلاق

source: Send Receipt
ar: ارسل نسخة

# send_notification
source: Send receipt
ar: ارسال إيصال

# email_hint
source: Email
ar: البريد الالكترونى

source: Send
ar: ارسال

# transaction_success
source: Transaction Approved
ar: عملية مقبولة

# invalid_mail
source: Invalid email address.
ar: البريد الالكترونى غير صحيح

# mail_sent_to
source: Email sent to
ar: تم إرسال بريد الكترونى الى

# cannot_send_mail
source: Cannot send email, try again.
ar: تعذر ارسال البريد الالكترونى

source: Transaction declined
ar: عملية مرفوضة

source: Try again
ar: حاول مرة أخرى

# open_wallet_app
source: Please Scan the QR code with your Meeza Digital app. to make payment.
ar: قم بفتح تطبيق ميزة ديجيتال لتتمكن من اتمام المعاملة

# enter_send_money
source: 1-Enter send money
ar: 1-اضغط ارسال اموال

source: Help?
ar: مساعدة؟

source: QR Code
ar: كود الدفع

source: SMS
ar: رسالة

source: Quick Payment form
ar: نموذج الدفع السريع

# select_send_money
source: 2-Select send money
ar: 2-اختر ارسال اموال

# select_qr_code
source: 3-Select QR code
ar: 3-اختر كود الدفع

# scan_qr_code
source: 4-Scan QR code on the left
ar: 4-وجة المحمول على كود الدفع

# enter_pin
source: 5-Then enter m-PIN
ar: 5-تحقق من ادخال رمز التحقق

# enter_mobile_number
source: Enter MeezaDigital ID or Consumer Mobile
ar: أدخل رقم ميزة ديجيتال/رقم المحمول

# mobile_number
source: MeezaDigital ID/Mobile Number
ar: رقم ميزة ديجيتال/رقم المحمول

# send_otp
source: Send
ar: ارسال

source: invalid mobile number.
ar: رقم المحمول غير صحيح

# enter_pin_code
source: Enter PIN
ar: ادخل ال PIN

# sms_received_within
source: SMS should be received within
ar: ستصلك رسالة فى غضون

source: Seconds
ar: ثوانى

# terms_conditions_text
source: This is the terms and conditions to use pay sky payment service integration.
ar: شروط واحكام شركة باى سكاى لاستخدام خدماتها

# swipe
source: Read Card
ar: اسحب البطاقة

source: Send SMS success.
ar: تم ارسال الرسالة.

source: OR
ar: أو

# cant_scan_code
source: Can't scan Qr code? Send payment request to MeezaDigital ID/Mobile Number
ar: لا تستطيع فحص الصور؟ قم بارسال المعاملة عن طريق رقم ميزة ديجيتال/رقم المحمول

source: Request Payment
ar: طلب اموال

# invalid_expire_date_date
source: Invalid Expiry date
ar: تاريخ الانتهاء غير صحيح

source: EGP
ar: جنية

# print
source: Print receipt
ar: إطبع الفاتوره

source: Accepted operation
ar: عمليه مقبوله

source: Confirm receipt info
ar: تأكيد بيانات الايصال

# enter_manual
source: Enter card data
ar: ادخل بيانات الكارت

# no_payment_selected
source: No payment method selected.
ar: لم يتم اختيار طريقه الدفع

# read_qr
source: Read QR code
ar: إقرأ كود الدفع

# magnetic
source: Read card
ar: إقرأ البطاقة

# device_not_support_magnetic
source: Device not support magnetic card payment.
ar: الجهاز لا يدعم خاصيه قراءة البطاقة

# mobile_number_valid
source: please enter mobile number
ar: من فضلك ادخل رقم المحمول

# DateTF_NOTVALID
source: Please enter Expiry date
ar: من فضلك ادخل تاريخ انتهاء صلاحية البطاقة

# cardNumber_NOTVALID
source: Please enter card number
ar: من فضلك ادخل رقم الكارت

# cardNumber_VALID
source: Please enter valid card number
ar: من فضلك ادخل رقم الكارت صحيح

# DateTF_NOTVALID_AC
source: Card expiry date should be 4 digits
ar: تاريخ انتهاء صلاحية البطاقة يجب ان يكون 4 ارقام

# CVCTF_NOTVALID
source: CVC is required
ar: من فضلك ادخل رمز الحماية

# CVCTF_NOTVALID_LENGTH
source: CVC should be 3 digits length
ar: رمز الحماية يجب ان يكون مكون من 3 ارقام

# please_entre_your_mail
source: please enter your email
ar: من فضلك ادخل البريد الالكتروني

# please_entre_valid_mail
source: please enter valid email
ar: من فضلك ادخل البريد الالكتروني صحيح

# email_send_to
source: Email sent to
ar: تم ارسال بريد الكترونى الي

source: Error
ar: حدث خطأ

# validation_card
source: Card validation
ar: التحقق من البطاقة

# CardHolderNameRequird
source: Card holder name is required
ar: من فضلك ادخل اسم صاحب البطاقة

# please entre merchant
source: please enter merchant
ar: من فضلك ادخل رقم التاجر

# please entre terminal
source: please enter terminal
ar: من فضلك ادخل رقم نقطة البيع

# please entre amount
source: please enter amount
ar: من فضلك ادخل المبلغ

# please entre currency
source: please enter currency
ar: من فضلك ادخل رقم العملة

source: please entre your mail
ar: من فضلك ادخل بريدك الالكتروني

# ref_number
source: Ref #
ar: الرقم المرجعي

source: please entre secure hash value
ar: من فضلك ادخل secure hash

source: please entre valid secure hash value
ar: من فضلك ادخل secure hash صحيح

source: EGP
ar: جنية

source: AED
ar: درهم

source: GBP
ar: جنية
